app/Controllers/Distributor.php

INSERT INTO `distributor` (`nama`, `kota`, `provinsi`, `negara`, `telepon`, `email`, `created_at`, `updated_at`) VALUES ('Janji Janji', 'Serpong', 'Tangerang', 'indonesia', 'rahasia', 'banyakjanji@email.com', '2023-08-10 06:44:00', '2023-08-10 06:44:00')
---
    public function save()
    {
        $this->DistributorModel->save([
            'nama' => $this->request->getVar('nama'),
            'kota' => $this->request->getVar('kota'),
            'provinsi' => $this->request->getVar('provinsi'),
            'negara' => $this->request->getVar('negara'),
            'telepon' => $this->request->getVar('telepon'),
            'email' => $this->request->getVar('email'),
        ]);