app/Models/DistributorModel.php

SELECT *
FROM `distributor`
SELECT *
FROM `distributor`
WHERE `nama` = 'ada'
 LIMIT 1
---
    public function getDistributor($nama = false)
    {
        if ($nama == false) {
            return $this->findAll();
        }

        return $this->where(['nama' => $nama])->first();